% - Все величины указаны в системе единиц СИ, если иное не сказанно

% За начало координат примем центр тяжести (ЦТ) аппарата (потом можно изменить
% при необходимости) тогда радиус вектор ЦТ в такой СК 
CGPosition = [0.1590;0;0.09];

%%%%%%%%%%%%%%%%%%%%%
% Начальные условия %
%%%%%%%%%%%%%%%%%%%%%
Init.LLA = [56.12*pi/180; 42.43*pi/180; 120];
Init.Vned = 25; % в предположении, что скорость по продольной оси,
% но можно сделать и вектор скорости в ССК (так удобнее)
Init.Euler = [0; 3; 30]*pi/180;
Init.Rates = [0;0;0]*pi /180;

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% Массовые и геометрические характеристики ЛА %
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
UAV.mass = 11.0; % масса ЛА

UAV.Jx = 0.824; % Компоненты тензора инерции
UAV.Jy = 1.135;
UAV.Jz = 1.759;
UAV.Jxz = 0.120;

UAV.J = [[UAV.Jx 0 -UAV.Jxz]; % Тензор инерции
    [0 UAV.Jy 0];
    [-UAV.Jxz 0 UAV.Jz]];

UAV.G = UAV.Jx*UAV.Jz-UAV.Jxz*UAV.Jxz;

UAV.Jinv = [[UAV.Jz/UAV.G 0 UAV.Jxz/UAV.G]; % Тензор обратный к тензору инерции
    [0 1/UAV.Jy 0];
    [UAV.Jxz/UAV.G 0 UAV.Jx/UAV.G]];

UAV.G1 = UAV.Jxz*(UAV.Jx-UAV.Jy+UAV.Jz)/UAV.G; % Коэффициенты для динамики вращательного движения
UAV.G2 = (UAV.Jz*(UAV.Jz-UAV.Jy)+UAV.Jxz*UAV.Jxz)/UAV.G;
UAV.G3 = UAV.Jz/UAV.G;
UAV.G4 = UAV.Jxz/UAV.G;
UAV.G5 = (UAV.Jz-UAV.Jx)/UAV.Jy;
UAV.G6 = UAV.Jxz/UAV.Jy;
UAV.G7 = ((UAV.Jx-UAV.Jy)*UAV.Jx + UAV.Jxz*UAV.Jxz) / UAV.G;
UAV.G8 = UAV.Jx/UAV.G;

UAV.S = 0.55; % Площадь крыла
UAV.b = 2.9; % Разsмах
UAV.c = 0.19; % Средняя аэродинамическая хорда крыла

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% Параметры силовой установки %
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

BatteryVoltage = 44.4; % Номинальное напряжение батареи
Dprop = 0.508; % Диаметр воздушного винта
KV = 0.0659; % Коэффициент вращения мотора
KQ = 0.0659; % Коэффициент механического момента мотора
% KQ = KV так как записанны в СИ
Rmotor = 0.042; % Сопротивление обмоток мотора
i0 = 1.5; % Ток холостого хода мотора

% Коэффициенты разложения механического момента винта по степеням поступи
CQ0 = 0.005230;
CQ1 = 0.004970;
CQ2 = -0.01664;

% Коэффициенты разложения тяги винта по степеням поступи
CT0 = 0.09357;
CT1 = -0.06044;
CT2 = -0.1079;

% Положение мотора в ССК
% В предположении, что ось винта совпадает спродольной осью ЛА, 
% А смещения в поперечном направлении нет
MotorPosition = [0; 0; 0];

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% Аэродинамические коэффициенты %
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

% Коэффициент подемной силы ЛА 
A.CL0 = 0.23; % Значение коэффициента подъемной силы ЛА при нулевом 
% угле атаки, отсутствии отклонения руля высоты и отсутствии вращения

A.CLa = 5.61; % Приращение засчет изменения угла атаки 
A.CLq = 7.95; % Приращение засчет вращения по тангажу
A.CLde = 0.13; % Приращенмия засчет отклонения руля высоты

% Коэффициент силы лобового сопротивления
A.CD0 = 0.043;
A.CDa = 0.03;
A.CDq = 0;
A.CDde = 0.0135;

% Коэффициент боковой силы
A.CN0 = 0;
A.CNb = -0.83;
A.CNp = 0;
A.CNr = 0;
A.CNda = 0.075;
A.CNdr = 0.19;

% Коэффициент момента тангажа
A.Cm0 = 0.0135;
A.Cma = -2.74;
A.Cmde = -0.99;
A.Cmq = -38.21;

% Коэффициент момента крена
A.Cl0 = 0;
A.Clb = -0.13;
A.Clp = -0.51;
A.Clr = 0.25;
A.Clda = 0.17;
A.Cldr = 0.0024;

% Коэффициент момента рыскания
A.Cn0 = 0;
A.Cnb = 0.073;
A.Cnp = -0.069;
A.Cnr = -0.095;
A.Cnda = -0.011;
A.Cndr = -0.069;

%Положение аэродинамического фокуса ЛА - точки относительно которой
%приложены аэродинамические силы
A.CenterOfPressure = [0.1425; 0; 0];

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% Параметры Земли согласно WGS84 %
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

WGS84.a = 6378137.0; % Большая полуось эллипсоида

WGS84.FlatteningFactor = 298.257223563; % Параметр сжатия эллипсоида
% равный обратной величине к полярному сжатию f = (a - b) / a

WGS84.b = (1 - 1/WGS84.FlatteningFactor)*WGS84.a; % малая полуось эллипса

WGS84.e1 = sqrt((WGS84.a*WGS84.a - WGS84.b*WGS84.b) / (WGS84.a*WGS84.a)); % Первый эксцентриситет

WGS84.e2 = sqrt((WGS84.a*WGS84.a - WGS84.b*WGS84.b) / (WGS84.b*WGS84.b)); % Второй эксцентриситет

WGS84.GravityEquator = 9.7803253359; % Ускорение свободного падения на экваторе эллипсоида

WGS84.GravityPole = 9.8321849379; % Ускоренре свободного падения на полюсе эллипсоида

WGS84.GravityConstant =  1.931852652458e-3; % WGS84_b*WGS84_GravityPole / (WGS84_GravityEquator * WGS84_a) - 1;

WGS84.w = 7.292115e-5; % Среднее значение угловой скорости вращения Земли

WGS84.GM = 3.986004418e14; % Геоцентрическая гравитационная константа - произведение массы Земли на гравитационную постоянную

WGS84.m = (WGS84.w * WGS84.a)^2 * WGS84.b / WGS84.GM; 
